In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

In [2]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

In [3]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [4]:
# Notice the index values. We can changes those to be what we want them to be

In [5]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
# We can now call the values using the labeled index

In [7]:
# We can also pass in numpy arrays

In [9]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [10]:
# We can also pass in dictionaries
# Pandas will set the keys as index labels and the values as data

In [11]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [12]:
ser1 = pd.Series([1,2,3,4], ['USA', 'Germany', 'USSR', 'Japan'])

In [13]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [16]:
ser2 = pd.Series([1,2,5,4], ['USA', 'Germany', 'Italy', 'Japan'])

In [17]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [18]:
# Grabbing information out of a series is much like grabbing data out of 
# Python dictionary
ser1['USA']

1

In [20]:
# If we try to add Series together, it will attempt to match the index
# Anywhere it doesn't find a match, it will but a null value
# Note that when performing operations on pandas series or data frames, 
# the integers are converted to floats so you don't lose information
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# Data Frames

In [25]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [26]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
# Each coloumn is a pandas series
# W, X, Y, X are just a pandas series
# They just happen to share an index

In [28]:
# Notice that if we just call the 'W' column, the output looks just like a series
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [29]:
type(df['W'])

pandas.core.series.Series

In [30]:
# To get multiple columns, you can pass in a list of columns
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [31]:
# To create a new column, you can define it as if it already exists
# And you can use other columns to do arithmetic. 
df['new'] = df['W'] + df['Y']

In [32]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [33]:
# to remove columns you need to specify the column axis
# default is to remove a row based on an index. 
df.drop('new', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
# However, notice that this doesn't actually impact the dataframe
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [35]:
# To legit delete the column or row from the dataframe, you need to change 
# inplace argument for the drop method. You change it to True. 
df.drop('new', axis=1, inplace=True)

In [36]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
# Can also use drop method to drop rows
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [39]:
# To select rows
# There are two ways to select rows
# Notice the rows are series as well.

In [40]:
# .loc is based off of label for the row
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [41]:
# .iloc is based off of the index value of the row
# even if they are labeled by strings
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [42]:
# We can also get specific values. Similar to numpy
df.loc['B', 'Y']

-0.8480769834036315

In [43]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

# Data Frames part 2

In [2]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

In [3]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'],['W','X','Y','Z'])

In [4]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [5]:
# Conditional Selection

In [6]:
# This returns a dataframe of boolean values
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [7]:
# So now we can create boolean data frames
booldf = df > 0
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [8]:
# If we then pass it into our original dataframe, we will get the values
# where the comparison was true, and nulls where it was false
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [9]:
# probably wouldn't separate it out to two steps
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
# What is more common is to pass in a row or column, rather than a whole df
# This has the benefit of not returning nulls
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [11]:
# We can use this series of boolean values corresponding to rows to filter out
# rows based off of a column's value
# Since row C was false, when we pass it back into the dataframe, 
# row C is not included
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [12]:
# Say we want to grab all the rows of a data frame where z is less than 0
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [13]:
# Since a dataframe is returned, we can run more operations
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [14]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [15]:
# The same operation, but broken into multiple steps
boolser = df['W']>0
result = df[boolser]
mycols = ['Y','X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [17]:
# Using more than one condition
# This will return an error
# df[(df['W']>0) and (df['Y']>1)]
# Python cannot compare one series of boolean values to another series of boolean values
# The 'and' operator can only take into account one bool value at a time
# So we have to use & instead
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [18]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
# Resetting the index or setting it to something else
# Notice this gives you the previous index as a new column
# By default, this does not occur in place
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [20]:
newind = 'CA NY WY OR CO'.split()

In [22]:
df['States'] = newind

In [23]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [24]:
# Note that this overrides the old index and is gone
# Again, this is not an inplace operation
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

# DataFrames Part 3

In [27]:
import numpy as np
import pandas as pd

In [28]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [29]:
list(zip(outside, inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [32]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [30]:
# Multilevel index, or a index hierarchy
df = pd.DataFrame(randn(6,2), hier_index, ['A','B'])

In [31]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [33]:
# how to call data from it

In [34]:
# To grab everything from G1
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [35]:
# To just get the first row of G1
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [36]:
# Right now the two indices are unnamed (since, there is no name above them)
df.index.names

FrozenList([None, None])

In [38]:
# Now they have names
df.index.names = ['Groups', 'Num']
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [39]:
# To grab a specific value... work from the outside in
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [40]:
# To return a cross section of rows or columns
# Function xs used when there is a multilevel index
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [41]:
# notice though that this is the same result as df.loc['G1']
# The difference is that xs has the ability to skip or go inside a 
# multi-level index
# Say you wanted to grab Num 1 from both groups
df.xs(1, level= 'Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

# Missing Data

In [42]:
import numpy as np
import pandas as pd

In [44]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [45]:
df = pd.DataFrame(d)

In [46]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [47]:
# To drop missing values from the dataset
# dropna() will drop any row from the df that has 1 or more NaN
# not inplace
df.dropna()

     A    B  C
0  1.0  5.0  1

In [49]:
# to do it on the columns, specifcy the axis
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [51]:
# We can also specify a threshold
# the threshold argument is an integer value that requires that
# many non-Na values to not be dropped
# notice that this keeps row 1 because it has at least 2 non-NaN values
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [52]:
# To fill in missing values, we use the fillna method
# we can pass in a fill value
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [53]:
# Or we can fill it with the mean of the column
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Group By

In [54]:
# Groupby allows you to group together rows based off of a column and 
# perform an aggregate function on them
# For example, group by an id and sum the values

In [55]:
import numpy as np
import pandas as pd

In [58]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charle','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [59]:
df = pd.DataFrame(data)

In [60]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG   Charle    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [62]:
# So we can groupby column name
# But this only returns a groupby object that points to a spot in memory
byComp = df.groupby('Company')

In [63]:
byComp

In [64]:
# We then have to do some sort of aggregate function on it
# The mean function doesn't work on the Person column because they are strings
# Pandas automatiicaly ignores columns that the aggregate function does not work on
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [65]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [66]:
# Notice that you get a dataframe back, so you can do normal dataframe stuff
# This gives you the sum of the sales for FB
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [67]:
# once you are comfortable with pandas, you will probably do this in one line, as such
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [68]:
# Another userful aggregate function is count
# Counts the instances per column
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [69]:
# Another useful function is describe
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# Merging, Joining, and Concatenating

In [1]:
# See the lecture notes

# Operations

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
# Finding unique values in a dataframe

In [5]:
# Imagine you wanted to find all the unique values in col2
# This returns a numpy array of the unique values in col2
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [6]:
# what if you wanted the number of unique values?
# You could just check the length of the returned array
len(df['col2'].unique())

3

In [7]:
# But pandas has s built in function for this
df['col2'].nunique()

3

In [8]:
# We can also get a table of how many times a unique value appeared in a column
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [9]:
# Selecting Data

In [10]:
# Conditional Selection (discussed before but here for emphasis)
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [11]:
# To combine conditions
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [12]:
# Apply method - One of the most powerful tools

In [13]:
# Imagine we have this simple function
def times2(x):
    return x*2

In [14]:
# We know that we can grab a column and to a built in function on it, e.g., 
df['col1'].sum()

10

In [15]:
# But what if we wanted to do apply our function to all those values?
# The apply method will broadcast your function
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [16]:
# We can also broadcast built in functions
# Col3 has different strings. Say we wanted the length of those strings
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [18]:
# We can also use lambda expressions
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [19]:
# Removing columns

In [20]:
# To rmeove a column, we drop it
# Since we are removing a column, we need to specify the axis
# This is not an inplace function
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [22]:
# If we wanted to get the columns and index names off the dataframe
# They are attributes of the dataframe itself
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [23]:
# Since it is a range index, pandas returns the start, stop, and step
df.index

RangeIndex(start=0, stop=4, step=1)

In [24]:
# Sorting

In [25]:
# Notice how the index stays attached to the row
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [26]:
# To find null values
# Returns a boolean dataframe
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [27]:
# Pivot Table
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [28]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [29]:
# Pivot tables basically allows you to create a multi-index table
df.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input and Output

In [42]:
# Pandas has the ability to read and write data
# For this lecture, we will only concern ourselves with:
# CSV, Excel, HTML, and SQL

In [43]:
import pandas as pd

In [44]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [45]:
# To save it to a dataframe
df = pd.read_csv('example')

In [46]:
# To write to something
# Want to set index to false because if we were to read the new file, 
# pandas will not recognize it as the original index
# It will think it is a column and assign a new index
df.to_csv('My_output', index=False)

In [47]:
# Pandas can read excel files, but only the values, not formulas, macros, etc. 
pd.read_excel('Excel_Sample.xlsx',sheetnme='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [48]:
# Writing to excel
df.to_excel('Excel_Sample2.xlsx',sheet_name='NewSheet')

In [49]:
# HTML

In [50]:
data = pd.read_html('https://www.fdic.gov/Bank/individual/failed/banklist.html')

In [51]:
# So pandas searches the html code and makes a list of all the table references 
# it finds in the html. You then have to figure out which dataframe in the list
# is the one you are interested in. 
data[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [53]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

In [55]:
# SQL
# You should find the specific python library meant to work with specific 
# SQL types since there is so many different types of SQL

In [56]:
from sqlalchemy import create_engine

In [58]:
# This creates a temporary, and small SQLite engine running in memory
engine = create_engine('sqlite:///:memory:')

In [59]:
df.to_sql('my_table',engine)

In [60]:
sqldf = pd.read_sql('my_table',con=engine)

In [61]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15